Repository: BilderHerunterlader/BilderHerunterlader
Catalog: website/page/*.po
Languages: de

source: The rules are stored in XML-Files in the subfolder "rules" of the program folder.
de: Die Regeln werden in XML-Dateien gespeichert und zwar im Unterordner "rules" des Programmordners.

source: Directly linked images
de: Direkt verlinkte Bilder

source: If it is nessesary to download directly linked images or other files, you can enable this with regular expressions. That class detects by default only a small number of URLs. To allow more URLs to be downloaded you have to create a textfile with the name HostzDefaultImages.txt in the hosts folder. In that file you have to write one expression per line. Here is an example:
de: Falls es nötig sein sollte andere direkt verlinkte Bilder oder sonstige Dateien runterzuladen, kann man mit Regulären Ausdrücken dafür sorgen. Diese Klasse erkennt standardmässig aber nur gewisse URLs. Um nun weitere anzugeben muss im hosts Ordner eine Text-Datei mit dem Namen HostzDefaultImages.txt angelegt werden. In dieser Datei muss dann pro Zeile ein Regulärer Ausdruck angegeben werden. Hier mal ein Beispiel wie es aussehen könnte:

source: The first expression allows to download file with some endings. The second expression allows to download attachments in the boardsoftware WBB. Upper and lower case at this point of the program is not respected.
de: Der erste Ausruck erlaubt Dateien mit gewissen Endungen herunterzuladen. Der zweite Ausdruck erlaubt das herunterladen von Attachements in der Boardsoftware WBB. Gross- und Kleinschreibung wird an dieser Stelle des Programms nicht beachtet.

source: Host-Plugins (Host-Classes)
de: Hoster-Plugins (Hoster-Klassen)

source: If this possibilities aren't enough and you can program in Java, then you can write your own classes which can be used as Hosters-Plugins. To compile such a class the sourcecode of the program is required. Because the class has to extend ch.supertomcat.bh.hoster.Host and has to implement the Interface ch.supertomcat.bh.hoster.IHoster.
de: Falls diese Möglichkeiten nicht reichen und man Java programmieren kann, so kann man eigene Klassen schreiben die als Hoster-Plugins funktionieren. Zum kompilieren der Klassen benötigt man den Sourcecode des Programmes. Die Klasse muss nämlich von ch.supertomcat.bh.hoster.Host ableiten und muss das Interface ch.supertomcat.bh.hoster.IHoster implementieren.

source: Download Java and install it, if not already done
de: Java herunterladen und installieren, falls es noch nicht installiert ist

source: Download BilderHerunterlader and install it
de: BilderHerunterlader herunterladen und installieren

source: Download and install the extension or plugin for your browser, if available.
de: Falls vorhanden, die Extension oder das Plugin für den Browser herunterladen und installieren

source: Start BilderHerunterlader
de: BilderHerunterlader starten

source: On the first start the default settings are used and you should change those to your needs.
de: Beim ersten Start werden die Standard-Einstellungen verwendet, diese sollte man nun an seine Bedürftnisse anpassen.

source: The most important options are:
de: Am wichtigsten sind folgende Einstellungen:

source: Connection
de: Verbindung

source: Direct Connection / Proxy: If you use a proxy, you must define that, otherwise the program is not working.
de: Direkte Verbindung / HTTP-Proxy: Falls du über einen Proxy ins Internet gehst, musst du diese bei dieser Einstellung angeben, sonst funktioniert gar nichts.

source: Folders
de: Verzeichnisse

source: Standard Savepath: Here you must choose a folder, in which you want to download the files.
de: Standard-Speicherort: Hier wählst du ein Verzeichnis aus, in welches die Dateien heruntergeladen werden sollen.

source: Other
de: Sonstige

source: Updates: Many hosts change their websites from time to time, so that the download with BilderHerunterlader is not working anymore. To fix that, there is a program internal Update-Function which updates BilderHerunterlader and the Rules and Host-Plugins. If the option is activated, the program checks on every start if there are upates. If you don't want that, you can still check for updates manually, in order to do that go to Info -> Update.
de: Updates: Viele Hostern ändern immer mal wieder ihre Webseiten, womit der Download mit BilderHerunterlader nicht mehr funktioniert. Dafür gibt es eine programminterne Update-Funktion die BilderHerunterlader auf dem aktuellen Stand hält und auch Regeln und Hoster-Plugins aktualisiert. Ist die Einstellung aktiviert, so wird bei jedem Start von BilderHerunterlader geprüft, ob es Updates gibt. Wenn man das nicht will, so kann man auch manuell auf Updates prüfen, dazu geht man auf Info -> Update.

source: Open a website which contains links to Images / Files in your browser
de: Eine Webseite im Browser öffnen, die Links zu Bildern / Dateien enthalten

source: In PaleMoon: Rightclick -> Download files with BH
de: Bei PaleMoon: Rechtsklick -> Dateien mit BH herunterladen

source: In Firefox: Rightclick -> BilderHerunterlader -> Download files with BH
de: Bei Firefox: Rechtsklick -> BilderHerunterlader -> Dateien mit BH herunterladen

source: In Opera: Rightclick -> Download files with BH
de: Bei Opera: Rechtsklick -> Dateien mit BH herunterladen

source: In the Internet Explorer: Rightclick -> Download files with BH
de: Beim Internet Explorer: Rechtsklick -> Dateien mit BH herunterladen

source: Alternative: Copy the URL of the website into the clipboard (ctrl + c). In order make it working that way, you need to enable the "Clipboard - Check for particular links" option in the settings.
de: Alternativ: URL der Webseite in die Zwischenablage kopieren (ctrl + c). Damit das funktioniert muss in den Einstellungen unter Sonstige die Option "Zwischenablage - Auf einzelne Links prüfen" aktiviert sein.

source: If nothing happens, click on "Check Clipboard now" on the System-Tray-Icon-Menu or in the menubar.
de: Falls nichts passiert, im System-Tray-Icon-Menü oder in der Menüleiste "Prüfe Zwischenablage" anklicken

source: Another alternative: Select the images / links in the browser and drag and drop the selection with the mouse to the program-window.
de: Weitere Alternative: Im Browser die Bilder / Links markieren und mit der Maus packen und im Programm-Fenster loslassen

source: Now a new window opens, which shows the available files
de: Nun öffnet sich ein neues Fenster, welches die verfügbaren Dateien anzeigt

source: Here you can change the download-directory or let it changed automatically by keywords. You can also select which files are downloaded and which not. And you can define some other things.
de: Hier kann man nun das Download-Verzeichnis ändern, oder es automatisch bestimmen lassen anhand von Schlüsselwörtern. Auch kann man festlegen welche Dateien heruntergeladen werden sollen. Und noch weitere Dinge festlegen.

source: For a detailed description of the possibilities you should read the feature-page
de: Für eine genaue Beschreibung aller Möglichkeiten sollte man die Feature-Seite gut durchlesen

source: Now click on OK and the files are added to the download-queue
de: Nun auf OK klicken und die Dateien werden in die Download-Warteschlange aufgenommen

source: Now click on Start on the download-queue and the files are downloading
de: Nun bei der Warteschlange auf Start klicken und die Dateien werden heruntergeladen

source: Some Host-Plugins have own settings
de: Einige Hoster-Plugins haben eigene Einstellungen

source: Those are not in the settings dialog, but under the Host-Plugins tab. In the list there is a "Settings" button if the Host-Plugin has settings.
de: Diese sind aber nicht bei den anderen Einstellungen, sondern unter dem Hoster-Plugins Tab. Dort in der Liste gibt es dann einen Button "Einstellungen" bei den Hoster, die Einstellungen haben.

source: This Host-Plugin is not for a specific hoster, but is used to detect any links.
de: Dieses Hoster-Plugin ist keinem Hoster zugeordnet, sondern sorgt dafür, dass direkt verlinkte Dateien unabhängig vom Hoster erkannt werden.

source: In the settings it can be chosen, which type of files to detect. It can also be configured to accept any kind of links
de: In den Einstellungen kann ausgewählt werden, welche Dateitypen akzeptiert werden. Es kann auch konfiguriert werden, dass alle Links akzeptiert werden

source: There is one more way to define more links to be detected by this Host-Plugin. It is described under "Directly linked images" on this page:
de: Es gibt noch einen Weg andere Links von diesem Plugin erkennen zu lassen. Dieser ist unter dem Punkt "Direkt verlinkte Bilder" auf dieser Seite beschrieben:

source: The logo in different resolutions, as SVG and as Windows-Ico-File.
de: Das Logo in verschiedenen Auflösungen, als SVG und als Windows-Ico-Datei.

source: Home
de: Startseite

source: Contact
de: Kontakt

source: Options
de: Einstellungen
