Repository: BilderHerunterlader/BilderHerunterlader
Catalog: website/page/*.po
Languages: de

source: Requirements:
de: Vorraussetzungen:

source: or higher
de: oder höher

source: Download-Page
de: Download-Seite

source: Please read the
de: Bitte lies erst noch die

source: tutorial
de: Anleitung

source: before installing
de: vor der Installation

source: BilderHerunterlader Setup (for Windows)
de: BilderHerunterlader Setup (für Windows)

source: BilderHerunterlader Setup (platform independent)
de: BilderHerunterlader Setup (Plattformunabhängig)

source: BilderHerunterlader Binaries in Zip-Archiv (for other operating systems)
de: BilderHerunterlader Binaries in Zip-Archiv (für alle anderen Betriebsysteme)

source: Usage:
de: Verwendung:

source: On a page with images: Rightclick -> Download files with BH
de: Auf einer Webseite mit Bildern: Rechtsklick -> Dateien mit BH herunterladen

source: The function can also be called directly by using the keyboard-shortcut Shift + B.
de: Mit der Tastenkombination Shift + B wird die Funktion direkt aufgerufen.

source: On a page with images: Rightclick -> BilderHerunterlader -> Download files with BH
de: Auf einer Webseite mit Bildern: Rechtsklick -> BilderHerunterlader -> Dateien mit BH herunterladen

source: Plugin for Opera:
de: Plugin für Opera:

source: Operating System
de: Betriebssystem

source: or Higher
de: oder höher

source: maybe also BSD and MacOS
de: möglicherweise auch BSD und MacOS

source: Read the readme.txt in the zip-file.
de: Lies die readme.txt in der zip-datei.

source: Plugin for Internet Explorer:
de: Plugin für Internet Explorer:

source: Other Browsers:
de: Andere Browser:

source: There are no extensions available for other browser at the moment. But you can use the program too.
de: Für andere Browser gibt es im Moment keine Extensions. Aber man kann das Programm trotzdem verwenden.

source: There are 2 ways:
de: Es gibt 2 Wege:

source: Turn on Clipboard-Monitoring and copy the URL of the webpage into the clipboard
de: Schalte die Zwischenablagenüberwachung ein und kopiere die URL der Webseite in die Zwischenablage (Ctrl + C)

source: Select the images in the Browser and drag and drop the selection to the program
de: Markier die Bilder im Browser und ziehe die Markierung ins Programm.

source: Will further hosts be supported?
de: Werden weitere Hoster unterstützt werden?

source: Yes, when it's technically possible. Send me an e-mail if you know a host, that isn't supported yet. And send also links with images hosted on that host.
de: Ja, falls es technisch möglich ist. Schicke eine E-Mail falls du einen Hoster hast, der noch nicht unterstützt wird. Und schicke auch gleich Links zu Beispielen mit. Du kannst aber auch selber ein Regel erstellen und mir dann die XML-Datei davon schicken.

source: The program caused an error. What should i do?
de: Das Programm hat einen Fehler verursacht. Was soll ich tun?

source: Send me an e-mail with an exact description of the error. Send me also the logfile (BH.log) as attechment. The logfile is stored in your profile folder in subfolder .BH.
de: Schreib mir eine E-Mail mit einer möglichst genauen Beschreibung des Fehler. Als Anhang solltest du das Logfile (BH.log) mitschicken. Das Logfile findest du in deinem Profil-Ordner im Unterordner .BH.

source: Where is my profile folder?
de: Wo befindet sich mein Profil-Ordner?

source: Under Windows you can find the folder, when you type %userprofile%.BH in the Explorer. Under Linux you can find the folder over ~/.BH
de: Bei Windows findet man den Ordner indem man im Explorer %userprofile%\.BH eingibt. Bei Linux findet man den Ordner über ~/.BH

source: A file is downloaded, but the progressbar ins't moving. Why?
de: Eine Datei wird zwar heruntergeladen, aber die Fortschrittanzeige bewegt sich nicht. Wieso?

source: Some server don't send the size of the file. Without knowing the size the progressbar can't be shown correctly. So the progressbar isn't moving.
de: Das liegt daran, das bei einigen Servern die Grösse des Bildes nicht ermittelt werden kann. Und ohne diese Grösse kann die Fortschrittanzeige nichts sinnvolles anzeigen, deshalb bewegt sie sich nicht.

source: Are there any other commandline arguments?
de: Gibt es noch andere Kommandozeilen-Argumente?

source: Yes. Here is the full list:
de: Ja, hier ist die volle Liste:

source: Prints the Version of BH (e.g. 1.2.0)
de: Gibt die Version aus (z.B. 1.2.0)

source: Prints the VersionNumber of BH (e.g. 120)
de: Gibt die Version-Nummer aus (z.B. 120)

source: Download-Selection
de: Download-Auswahl

source: Selection of files to download
de: Auswahl der Dateien, welche heruntergeladen werden sollen

source: Files which have already been downloaded are deselected automatically
de: Dateien, die schon mal heruntergeladen wurden, werden automatisch abgewählt

source: Files which have already been downloaded are marked blue, others red
de: Dateien die noch nicht heruntergeladen wurden, werden Blau markiert, die anderen Rot

source: This is only working if in the settings under download "Save logs" is enabled
de: Funktioniert nur wenn in den Einstellungen unter Download "Logs speichern" aktiviert ist

source: Manual selection of the download directory (for all files)
de: Manuelle Auswahl des Download-Verzeichnis (für alle Dateien)

source: Automatic selection of the download directory based on keywords
de: Automische Auswahl des Download-Verzeichnis anhand der Schlüsselwörtern

source: Can be activated by enabling "Automatic recognition"
de: Wird über "Automatische Erkennung" aktiviert

source: Recognition is done by title or filenames
de: Erkennung wird anhand des Titels oder der Dateinamen gemacht

source: The directory path is marked green, if a keyword was found
de: Der Verzeichnis-Pfad wird grün markiert, falls ein Schlüsselwort gefunden wurde

source: Manual selection of the download-directory by selecting a keyword or directory-selection and change of the filename
de: Manuelle Auswahl des Download-Verzeichnis anhand von einem Schlüsselwort oder der Verzeichnis-Auswahl und ändern des Dateinamens

source: Right click with the mouse on a file and to open the context-menu
de: Mit Rechtsklickt auf eine Datei klicken und das Kontext-Menü aufrufen

source: Buttons for fast select or deselect of files
de: Buttons für das schnelle Aus- und Abwählen von Dateien

source: Button for adding the title to the download-directory-path
de: Button für das Hinzufügen des Titels zum Download-Verzeichnis-Pfad

source: Textfield and a button to add the content of the textfield to the download-directory-path
de: Textfeld und Button für das Hinzufügen des Inhalts des Textfelds zum Download-Verzeichnis-Pfad

source: Button for the creation of new keywords
de: Button für das Erstellen neuer Schlüsselwörter

source: If there is something selected in the title-textfield, the selection is taken as name and directory for the keyword, but that can still be changed
de: Ist im Titel-Textfeld etwas markiert, wird die Markierung als Name und Verzeichnis für das Schlüsselwert angenommen, kann aber natürlich noch bearbeitet werden

source: Filenames in the download-selection could look ugly, but shortly before the download begins they are mostly changed to a nice one. The reason for that is that for some file-hosts the possibility to retrieve the original filename is only shortly before the download can begin.
de: Die Dateinamen in der Download-Auswahl können möglicherweise schrecklich aussehen, aber kurz vor dem Download wird meistens noch der Dateiname verschönert. Das liegt daran, dass bei einigen Bildhostern erst kurz vor dem Download die Möglichkeit besteht den originalen Dateiname zu erfahren.

source: Download-Queue
de: Download-Warteschlange

source: One click will stop files that are waiting for a free slot immediatly, but running downloads will be completed.
de: Einmal klicken bewirkt, dass Dateien die auf einen freien Slot warten, sofort gestoppt werden, gerade laufende Downloads werden aber noch fertig runtergeladen.

source: If you click twice also running downloads are stopped immediatly.
de: Klickt man zwei mal auf Stop, so werden auch gerade laufende Downloads sofort gestoppt.

source: Simultaneous Downloads
de: Gleichzeitige Downloads

source: Links from HTML-file
de: Links aus HTML-Datei

source: Links from text-file
de: Links aus Text-Datei

source: Links from a dialog-window
de: Links über ein Dialog-Fenster

source: Import / Export of Downloads
de: Import / Export von Downloads

source: Downloads can be exported to a text-file and imported again
de: Downloads können in eine Text-Datei exportiert werden und wieder importiert werden

source: Sort of files on the harddisk by using keywords
de: Sortieren von Dateien auf der Festplatte anhand der Schlüsselwörter

source: Files are treated as normal downloads. But instead of downloading, the files are just moved to the corresponding directory on working of the queue.
de: Dateien werden über die Download-Auswahl ausgewählt und wie normale Downloads behandelt. Anstatt heruntergeladen, werden die Dateien beim abarbeiten der Warteschlange dann einfach in das entsprechende Verzeichnis verschoben.

source: Logging of downloads (Date and time, Link, Directory and filename, Filesize)
de: Loggen von Downloads (Datum und Zeit, Link, Verzeichnis und Dateiname, Grösse)

source: Context-Menu for every file with useful actions
de: Kontext-Menü für jede Datei mit nützlichen Aktionen

source: Export log to a text-file
de: Log in Text-Datei exportieren

source: Keywords
de: Schlüsselwörter

source: Are used to download files directly to the desired directory
de: Werden benutzt um Dateien direkt ins gewünschte Download-Verzeichnis herunterzuladen

source: For every keyword a title can be given and you can define one or more (key)words (seperated by ; )
de: Einem Schlüsselwort kann man einen Titel geben und eins oder mehrere (Schlüssel)wörter angeben (getrennt durch ; )

source: A keyword can have an absolute or relative path (relative to the standard-download-directory)
de: Einem Schlüsselwort kann ein absoluter oder ein relativer Pfad angegeben werden (relativ zum Standard-Download-Verzeichnis)

source: Keywords from a text-file
de: Schlüsselwörter aus Text-Datei

source: The lines of the text-file must look like that:
de: So müss die Zeilen Text-Datei aussehen:

source: Title&nbsp;&nbsp;&nbsp;&nbsp;Keywords&nbsp;&nbsp;&nbsp;&nbsp;'Directory with absolute path'&nbsp;&nbsp;&nbsp;&nbsp;'Directory with relative path'&nbsp;&nbsp;&nbsp;&nbsp;relative path(true/false)
de: Titel&nbsp;&nbsp;&nbsp;&nbsp;Schlüsselwörter&nbsp;&nbsp;&nbsp;&nbsp;'Ordner mit absolutem Pfad'&nbsp;&nbsp;&nbsp;&nbsp;'Ordner mit relativem Pfad'&nbsp;&nbsp;&nbsp;&nbsp;Relativer Pfad(true/false)

source: The individual entries must be separated by tabs.
de: Die einzelnen Angaben müssen mit Tabulatoren getrennt werden.

source: If you don't want to specify an entrie, you have to write a #.
de: Will man etwas nicht angeben, muss man ein # hinschreiben.

source: Export to a text-file
de: In Text-Datei exportieren

source: Rules
de: Regeln

source: With Rules support for unsupported websites / file hosts can be added
de: Mit Regeln kann die Unterstützung für noch nicht unterstützte Webseiten / Filehoster hinzugefügt werden

source: The creation is described here:
de: Das Erstellen ist hier beschrieben:

source: With Host-Plugins support for unsupported websites / file hosts can be added
de: Mit Hoster-Plugins kann die Unterstützung für noch nicht unterstützte Webseiten / Filehoster hinzugefügt werden

source: Host-Plugins are programmed in Java
de: Hoster-Plugins werden in Java programmiert

source: Settings
de: Einstellungen

source: There are different options to customize the behavior of the program for your needs
de: Es gibt verschiedenste einstellungen um das verhalten des Programms an seine Bedürftnisse anzupassen

source: Some settings are described here:
de: Einige Einstellungen sind hier beschrieben:

source: Update-Function
de: Update-Funktion

source: Update of the program
de: Aktualisieren des Programms

source: Update of Host-Plugins and Rules
de: Aktualisieren der Hoster-Plugins und Regeln

source: Can also done automatically on the start of program, but that must be activated in the settings
de: Kann auch automatisch beim Start des Programms erfolgen, muss aber in den Einstellungen aktiviert werden

source: Description:
de: Beschreibung:

source: BilderHerunterlader is a program written in Java, which makes it easier to download images, hosted on image-host-websites. But it is not limited to that. It can not only download images, but any type of files. Support for additional hosts or websites can be added over user definded rules. With user definded keywords, files can directly downloaded to the right folder. The program is available in English or German.
de: BilderHerunterlader ist ein in Java geschriebenes Programm, welches das Herunterladen von Bildern, die auf Bild-Hostern gespeichert sind vereinfacht. Es ist aber nicht darauf begrenzt. Es können nicht nur Bilder sondern jegliche Art von Dateien runtergeladen werden. Über selbst definierbare Regeln kann man auf einfach Weise die Unterstützung für weitere Hoster oder Webseiten beibringen. Mit selbst definierbaren Schüsselwörtern kann dafür gesorgt werden, dass Dateien direkt in die richtigen Ordner gelangen. Das Programm ist in Englisch und Deutsch verfügbar.

source: This program is OpenSource and linsenced under the GPL (v2).
de: Das Programm ist OpenSource und ist lizenziert unter der GPL (v2).

source: Project-Page on GitHub
de: Projekt-Seite auf GitHub

source: Project-Page on SourceForge
de: Projekt-Seite auf SourceForge

source: Supported Operating Systems:
de: Unterstützte Betriebssysteme:

source: Windows, Linux, MacOS, BSD and any other operating system for which the JRE (Java Runtime Environment) is available.
de: Windows, Linux, MacOS, BSD und alle anderen Betriebssysteme wofür die JRE (Java Runtime Environment) zur Verfügung steht.

source: Supported Hosts:
de: Unterstütze Hoster:

source: Tutorial
de: Anleitung

source: Useful
de: Nützliches

source: BilderHerunterlader can also be used from an USB-Stick. But an installed JRE on the computers or a portable Java Runtime like jPortable is still required. To use BH from an USB-Stick, you have to create a textfile in the programfolder. The name of that textfile has to be: directories.properties In this file you can define the directories in which the databases, settings, logs and downloads are saved. If you wouldn't do that, then this data would be saved on the userprofile, but i think you want to have this data also an on the USB-Stick. So you need to create that textfile. There should be already a "directories.properties.example" file in the program folder, which you can just rename to "directories.properties" and edit it. The directories.properties file must look like this:
de: Der BH lässt sich auch von eines USB-Stick aus betreiben. Vorraussetzung ist aber immer, dass auf den Computern das JRE installiert ist oder das ein portables JRE, wie z.B. jPortable, verfügbar ist. Um BH von einem USB-Stick aus zu betreiben, muss man im Programmordner eine Textdatei anlegen und die Datei muss folgenden Namen haben: directories.properties In dieser Textdatei kann man die Verzeichnisse angeben, in denen die Datenbanken, Einstellungen und alles weitere gespeichert werden sollen. Diese Daten werden normalerweise im Benutzerprofil abgespeichert, was man nicht möchte, wenn man das Programm auf einem USB-Stick hat. Im Programmordner sollte bereits eine "directories.properties.example" Datei liegen, welche auf "directories.properties" umbenannt werden kann. Danach kann die Datei bearbeitet werden. Die directories.properties Datei muss etwa so aussehen:

source: In the example above the databases, settings and logs would be saved in the programmfolder in the subfolder "data". And downloaded files in subfolder "downloads". You can leave out some paths, then that data would be saved in the userprofile as usual. In the example above all posible paths are listed. There are only this 5 paths, which can be configured. If you want use the program from an USB-Stick, you have to define the directories relative to the programfolder. But it would also be possible to define the directories by absolute paths.
de: Im obigen Beispiel würden die Datenbanken, Einstellungen und Logs im Programmordner im Unterordner "data" gespeichert werden. Und heruntergeladene Dateien im Unterordner "downloads". In der Textdatei kann man auch einzelne Angaben weglassen, dann würde diese Daten einfach wieder im Benutzerprofil gespeichert. Im obigen Beispiel sind alle möglichen Angaben aufgelistet. Es gibt nur diese 5 Angaben. Will man das Programm von einem USB-Stick benutzen, muss man natürlich die Verzeichnisse, wie im obigen Beispiel, relativ zum Programmverzeichnis angeben. Es wäre allerdings auch möglich absolute Verzeichnisse anzugeben.

source: In BH everyone can define his own rules. It is possible to add support for other hosters. But you have to know regular expressions.
de: In BH kann jeder eigene Regeln definieren. Es ist also möglich selber die Unterstützung von anderen Hostern zu ermöglichen. Allerdings muss man sich mit Regulären Ausdrücken auskennen.

source: Possibility
de: Möglichkeit

source: If it is possible to replace something in the Container-URL or Thumbnail-URL to get the direct URL to the image than you can do so. You have to create a new rule. First you have to define a pattern for the Container-URL as regular expression, so that the rule knows for which URLs to search. Now you can make one or more replacements behind the other. The result from a replacement is used for the next replacement. Only the first replacement is using the Container-URL or Thumbnail-URL.
de: Wenn es möglich ist in der Container-URL oder der Thumbnail-URL etwas zu ersetzen um an die URL des eigentlichen Bildes zu kommen, dann kann man folgendes tun: Man erstellt eine neue Regel. Als erstes muss das Muster der Container-URL als Regulärer Ausdruck eingegeben werden, damit die Regel weiss für welche URLs sie zuständig ist. Nun ist es möglich mehrere Ersetzungen hintereinander durchzuführen. Dabei wird das Resultat von jeder Ersetzung für die nächste Verwendet, ausser die erste Ersetzung, die verwendet die Container-URL oder Thumbnail-URL.

source: Example
de: Beispiel

source: The Thumbnail-URL is:
de: Die Thumbnail-URL ist:

source: The search pattern is:
de: Das Suchmuster sieht dann wie folgt aus:

source: And the replacement looks like this:
de: Und das kann gleich ersetzt werden mit folgendem Ersetz-Muster:

source: We get the URL:
de: Wir erhalten also die URL:

source: You have to create a new rule. First you have to define a pattern for the Container-URL as regular expression, so that the rule knows for which URLs to search. Then you have to select the second mode. If the URL to the image can't get from the Container-URL, than you can let the program download the sourcecode of the webpage and you can make replacements in it. Here you can also do more than one searches behind the other. The result from a search is the position in the sourcecode where the pattern was found. The next search will use this position as startpoint for the search. The last search is taking the result and is replacing it. In the Replacement-Pattern you can use two variables:
de: Man erstellt eine neue Regel. Als erstes muss das Muster der Container-URL als Regulärer Ausdruck eingegeben werden, damit die Regel weiss für welche URLs sie zuständig ist. Bei der Auswahl wählt man dann die zweite Möglichkeit an. Falls die URL nicht aus der Container-URL ausfindig gemacht werden kann, so hat man die Möglichkeit den Quelltext der Seite herunterladen zu lassen und kann darin Suchen und Ersetzen. Auch hier kann man mehrere Suchen hintereinander schalten. Das Resultat der Suche, falls es nicht die letzte ist, ist die Position des Fundes im Quelltext. Die nächste Suche verwendet für die Suche dann das Resultat der letzten also die Position und sucht von dort aus weiter. Die letzte Suche nimmt das Resultat und ersetzt es. Beim Ersetz-Muster kann man zwei Variablen benutzen:

source: As URL we have:
de: Als URL nehmen wir mal an:

source: is replaced by the domain. So we get
de: wird vorher durch die Domain ersetzt. Also wird daraus

source: is replaced by the URL without the filename. We get
de: wird vorher durch die URL ersetzt. Also wird daraus

source: In the Search-Pattern you can use brackets to use the content as reference in the Replace-Pattern. We take as sourcecode this:
de: Im Such-Muster kann man durch setzen von Klammern diese als Referenz beim Ersetzen verwenden. Wir nehmen als Quelltext-Ausschnitt mal an:

source: As Search-Pattern we take:
de: Im Such-Muster geben wir nun an:

source: For this bracket you can use the reference $1. On replacing the program will also replace $1 with the content of the SRC-attribute. You can use more than one brackets, the reference are then nummbered. The first bracket is $1, the second is $2 and so on.
de: Für diese Klammer kann man nun die Referenz $1 benutzen. Beim ersetzen wird also $1 durch den Inhalt des SRC-Attributs ersetzt. Man kann mehrere Klammern setzen, die Referenzen werden dann einfach durchnummeriert. Also erste Klammer ist $1, zweite Klammer ist $2 und so weiter.

source: The source is downloaded first. As URL we take this:
de: Der Quelltext wird also zuerst heruntergeladen. Als URL nehmen wir mal:

source: Here is a part of the sourcecode from imagevenue:
de: Hier ein Ausschnitt aus dem Quelltext von Imagevenue:

source: The first search-pattern looks like this:
de: Das erste Such-Muster sieht so aus:

source: The search finds the position of the pattern in the sourcecode. Now we aren't at the right position, because we want the image, the content in SRC="" So we need a second search-pattern which looks like this:
de: Die Suche liefert die Position wo der Ausdruck gefunden wurde. Nun sind wir aber noch nicht am richtigen Ort, da wir ja das Bild wollen, also das was in SRC="" steht. Also benötigen wir ein zweites Such-Muster das so aussieht:

source: Now we got what we want. In the program the result is written to a variable. In this variable is now this:
de: Da wir nun das haben was wir wollen, wird im Programm intern das Ergebnis in eine Variable geschrieben. In der Variable steht dann also folgendes:

source: Now we have to define a Replace-Pattern in the last search. In this example we need $SRV$1 The program replaces now the variable with this pattern und we get the URL:
de: Nun müssen wir der Regel noch ein Ersetz-Muster angeben. Für unser Beispiel benötigen wir $SRV$1 Das Programm ersetzt also die Variable mit dem Muster und wir bekommen die URL:

source: You can now also correct the filename. This is working similar to Possibility 1. But for the search the filename from the Image-URL is used, not the whole URL. So, if the URL is
de: Weiter gibt es noch die Möglichkeit den Dateinamen zu korrigieren. Das ganze funktioniert genau gleich wie es bei Möglichkeit 1 der Fall ist. Nur wird zum Suchen nicht die URL verwendet sondern nur der Dateiname der Bild-URL. Ist die URL also

source: then it is used only
de: so wird dann davon nur

source: Share your rules with others
de: Regeln mit anderen teilen

source: If you have defined a rule and want to share it with other users of the program, you can send it to me. I will proof the rule and make it available over the update-function.
de: Falls du eine Regel erstellt hast und diese anderen Benutzern des Programs zur Verfügung stellen willst, so kannst du mir diese zusenden. Ich werde die Regel prüfen und dann über die Update-Funktion zur Verfügung stellen.

source: XML-Files of the Rules
de: XML-Dateien der Regeln
